04_OpenFoam/_ref/OpenFOAM-14/incompressibleFluid/propeller/system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            surfaces;
libs            ("libsampling.so");

writeControl    writeTime;

surfaceFormat   vtk;

writeFormat     binary;

fields          (p U Q);

interpolationScheme cellPoint;

surfaces
{
    zNormal
    {
        type            cutPlane;
        point           (0 0 0);
        normal          (0 0 1);
        interpolate     true;
    }

    isoQ
    {
        type            isoSurface;
        isoField        Q;
        isoValue        1000;
        interpolate     true;
    }

    propeller
    {
        type            patch;
        patches         ("propeller.*");
        interpolate     true;
    }
}


// ************************************************************************* //
